; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v1)
             (pred_11 ?v11 ?v8)
             (pred_1 ?v7 ?v8)
             (pred_8 ?v9 ?v7 )
	     (pred_3 ?v7)
             (pred_4 ?v3)
             (pred_5 ?v11)
             (pred_6 ?v8)
             (pred_2 ?v7)
             (pred_12 ?v11)
             (pred_7 ?v7)
             (pred_10 ))



(:action op_5
:parameters (?v12 ?v13 ?v5 ?v4)
:precondition (and (pred_4 ?v12) (pred_4 ?v13) (pred_5 ?v5) (pred_6 ?v4)
          (pred_9 ?v12 ?v13) (pred_11 ?v5 ?v4)
                   (pred_1 ?v13 ?v4) (pred_3 ?v12) 
                   (pred_2 ?v13) (pred_12 ?v5))
:effect (and  (pred_7 ?v13) (not (pred_2 ?v13))))


(:action op_3
:parameters (?v12 ?v2)
:precondition (and (pred_4 ?v12) (pred_4 ?v2)
               (pred_3 ?v12) (pred_9 ?v12 ?v2) (pred_7 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_4 ?v12) (pred_5 ?v5) 
                  (pred_3 ?v12) (pred_8 ?v5 ?v12) (pred_10 ))
:effect (and (pred_12 ?v5)
   (not (pred_8 ?v5 ?v12)) (not (pred_10 ))))


(:action op_2
:parameters (?v12 ?v10 ?v6)
:precondition (and (pred_4 ?v12) (pred_5 ?v10) (pred_5 ?v6)
                  (pred_3 ?v12) (pred_12 ?v6) (pred_8 ?v10 ?v12))
:effect (and (pred_12 ?v10) (pred_8 ?v6 ?v12)
        (not (pred_12 ?v6)) (not (pred_8 ?v10 ?v12))))

(:action op_4
:parameters (?v12 ?v5)
:precondition (and (pred_4 ?v12) (pred_5 ?v5) 
                  (pred_3 ?v12) (pred_12 ?v5))
:effect (and (pred_10 ) (pred_8 ?v5 ?v12) (not (pred_12 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_15 obj_25 obj_28 obj_03 obj_30 obj_05 obj_07 obj_23 obj_13 obj_16 obj_26 obj_17 obj_01 obj_08 obj_18 obj_09 obj_02 obj_20 obj_21 obj_22 obj_27 obj_04 obj_29 obj_12
    obj_19 obj_14
    obj_10 obj_24 obj_11
    )

    (:init
       (pred_10)

       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_25)
       (pred_4 obj_28)
       (pred_4 obj_03)
       (pred_4 obj_30)
       (pred_4 obj_05)
       (pred_4 obj_07)
       (pred_4 obj_23)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_20)
       (pred_4 obj_21)
       (pred_4 obj_22)
       (pred_4 obj_27)
       (pred_4 obj_04)
       (pred_4 obj_29)
       (pred_4 obj_12)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_24)
       (pred_5 obj_11)

       (pred_9 obj_06 obj_30)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_25)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_25 obj_07)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_25 obj_15)
       (pred_9 obj_28 obj_23)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_05)
       (pred_9 obj_30 obj_06)
       (pred_9 obj_05 obj_26)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_30)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_23)
       (pred_9 obj_07 obj_25)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_23 obj_28)
       (pred_9 obj_23 obj_07)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_23)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_26 obj_09)
       (pred_9 obj_26 obj_17)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_26)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_18 obj_22)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_09 obj_27)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_09 obj_26)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_22 obj_27)
       (pred_9 obj_22 obj_18)
       (pred_9 obj_27 obj_04)
       (pred_9 obj_27 obj_09)
       (pred_9 obj_27 obj_22)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_27)
       (pred_9 obj_29 obj_12)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_12 obj_29)
       (pred_2 obj_16)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_1  obj_16 obj_19)
       (pred_1  obj_15 obj_14)
       (pred_1  obj_09 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_25)
       (pred_7 obj_28)
       (pred_7 obj_03)
       (pred_7 obj_30)
       (pred_7 obj_05)
       (pred_7 obj_07)
       (pred_7 obj_23)
       (pred_7 obj_13)
       (pred_7 obj_26)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_20)
       (pred_7 obj_21)
       (pred_7 obj_22)
       (pred_7 obj_27)
       (pred_7 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_12)

       (pred_11  obj_10 obj_19)
       (pred_11  obj_24 obj_14)
       (pred_11  obj_11 obj_14)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_24 obj_12)
       (pred_8 obj_11 obj_27)
       (pred_3 obj_26)
    )

    (:goal (and
       (pred_8 obj_24 obj_06)
    ))
(:constraints
  (always (not (pred_3 obj_21)))
)
)

; plan
1. (op_3 obj_26 obj_05)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_05)
   goals met: 0 of 1
2. (op_3 obj_05 obj_07)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_23)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_23)
   goals met: 0 of 1
4. (op_3 obj_23 obj_01)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_01)
   goals met: 0 of 1
5. (op_3 obj_01 obj_20)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_3 obj_20 obj_29)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_29)
   goals met: 0 of 1
7. (op_3 obj_29 obj_12)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_24)
   deleted: (pred_8 obj_24 obj_12) (pred_10)
   added: (pred_12 obj_24)
   goals met: 0 of 1
9. (op_3 obj_12 obj_29)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_29)
   goals met: 0 of 1
10. (op_3 obj_29 obj_20)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_20)
   goals met: 0 of 1
11. (op_3 obj_20 obj_01)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_01)
   goals met: 0 of 1
12. (op_3 obj_01 obj_23)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_23)
   goals met: 0 of 1
13. (op_3 obj_23 obj_07)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_07)
   goals met: 0 of 1
14. (op_3 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_05)
   goals met: 0 of 1
15. (op_3 obj_05 obj_30)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_30)
   goals met: 0 of 1
16. (op_3 obj_30 obj_06)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_06)
   goals met: 0 of 1
17. (op_4 obj_06 obj_24)
   deleted: (pred_12 obj_24)
   added: (pred_10) (pred_8 obj_24 obj_06)
   goals met: 1 of 1
